package com.magfin.web.process;

/**
 * @Time 2019/4/20
 * @Author 佛祖保佑的最
 */
public class ActivityAPI  {

    /**
     * 部署流程定义
     */

    /**
     * 删除部署信息
     */

    /**
     * 删除流程定义
     */

    /**
     * 查询部署列表
     */

    /**
     * 查询流程定义列表
     */

    /**
     * 查询一次部署对应的流程定义文件,和数据流(png，xml，bpmn)
     */



    /**
     * 启动流程
     * 方式一：根据流程定义的id启动
     * 方式二：根据流程定义的key启动(自动选择最新版本的流程定义启动流程实例)
     */


    /**
     * 查询流程实例列表
     */


    /**
     * 结束流程实例 (拒绝)
     */

    /**
     * 查询任务列表
     */

    /**
     * 办理任务
     */


    /**
     * 直接将流程向下执行一步
     */

}
